var fileName = ['11101', '11106', '11201', '11202', '11203', '11204', '11205', '11206', '11207', '11209', '11210', '11211', '11212', '11215', '11216', '11217', '11301', '11302', '11304', '11305', '11306', '11308', '11309', '11310', '11311', '11312', '11313', '11314', '11315', '11318', '11319', '11321', '11322', '11323', '11325', '11326', '11401', '11403', '11405', '11406', '11407', '11410', '11501', '11502', '11503', '11504', '11506', '11507', '11508', '11509', '11510', '11511', '11602', '11604', '11606', '11608', '11609', '11701', '11702', '11707', '11710', '11714', '12101', '12104', '12201', '12202', '12203', '12205', '12206', '12207', '12209', '12211', '12212', '12213', '12214', '12215', '12216', '12217', '12218', '12219', '12220', '12221', '12222', '12223', '12224', '12225', '12226', '12227', '12228', '12229', '12231', '12232', '12233', '12234', '12235', '12236', '12237', '12238', '12239', '12240', '12241', '12242', '12243', '12301', '12303', '12304', '12401', '12402', '12403', '12404', '12405', '12406', '12501', '12502', '12503', '12505', '12506', '12507', '12508', '12509', '12510', '12511', '12512', '12513', '12514', '12515', '12516', '12517', '12518', '12519', '12520', '12521', '12522', '12601', '12603', '12604', '12605', '12606', '12701', '13212', '14408', '14504', '17101', '17102', '17103', '17104', '17105', '17106', '17107', '17108', '17109', '17110', '17112', '17113', '17201', '17202', '17204', '17205', '17207', '17209', '17210', '17211', '17212-I', '17212-II', '17212-III', '17301', '17302', '17307', '17308', '17315', '17321', '17322', '17326', '17329', '17330', '17331', '17339', '17341', '17403', '17410', '17417', '21202', '21207', '21401', '21402', '21501', '22101', '22102', '22103', '22104', '22105', '22107', '22202', '22204', '22206', '22212', '22213', '22217', '22220', '22221', '22222', '22223', '22224', '22301', '22302', '22303', '22401', '22403', '22405', '22406', '22407', '22408', '22409', '22410', '22412', '22413', '22414', '22415', '22416', '22417', '22418', '22419', '22420', '22421', '22422', '22425', '22426', '22428', '22429', '22430', '22431', '22432', '22433', '22434', '22436', '22437', '22438', '22440', '22442', '22501', '22503', '22506', '22507', '22510', '22511', '22512', '22513', '22514', '22515', '22516', '22517', '22518', '22519', '22520', '22521', '22523', '22526', '22601', '22603', '22604', '22606', '22607', '22609', '22610', '22611', '22613', '22614', '22615', '22701', '22702', '22703', '22704', '22705', '22706', '22708', '22710', '22801', '22803', '22804', '31101', '31204 II', '31403', '31407', '31409', '31410', '31411', '31414', '31415', '31417', '31418', '31419', '31420', '31421-複寫全', '31503', '31515', '31535', '31537', '31538', '31601', '31602', '31604', '31605', '31606', '31701', '31702', '31703', '31801', '31802-05之0.jpg', '31802-05之1.jpg', '31802-05之10.jpg', '31802-05之11.jpg', '31802-05之12.jpg', '31802-05之13.jpg', '31802-05之14.jpg', '31802-05之15.jpg', '31802-05之16.jpg', '31802-05之17.jpg', '31802-05之18.jpg', '31802-05之19.jpg', '31802-05之2.jpg', '31802-05之20.jpg', '31802-05之21.jpg', '31802-05之22.jpg', '31802-05之23.jpg', '31802-05之3.jpg', '31802-05之4.jpg', '31802-05之5.jpg', '31802-05之6.jpg', '31802-05之7.jpg', '31802-05之8.jpg', '31802-05之9.jpg', '31802-18之0.jpg', '31802-18之1.jpg', '31802-18之10.jpg', '31802-18之11.jpg', '31802-18之12.jpg', '31802-18之13.jpg', '31802-18之2.jpg', '31802-18之3.jpg', '31802-18之4.jpg', '31802-18之5.jpg', '31802-18之6.jpg', '31802-18之7.jpg', '31802-18之8.jpg', '31802 - 18之9.jpg', '31802 - 28之0.jpg', '31802 - 28之1.jpg', '31802 - 36之0.jpg', '31802 - 36之1.jpg', '31802 - 38之0.jpg', '31802 - 38之1.jpg', '31802 - 57之0.jpg', '31802 - 57之1.jpg', '31802 - 57之10.jpg', '31802 - 57之11.jpg', '31802 - 57之12.jpg', '31802 - 57之13.jpg', '31802 - 57之14.jpg', '31802 - 57之15.jpg', '31802 - 57之16.jpg', '31802 - 57之17.jpg', '31802 - 57之18.jpg', '31802 - 57之19.jpg', '31802 - 57之2.jpg', '31802 - 57之20.jpg', '31802 - 57之21.jpg', '31802 - 57之22.jpg', '31802 - 57之23.jpg', '31802 - 57之24.jpg', '31802 - 57之25.jpg', '31802 - 57之26.jpg', '31802 - 57之3.jpg', '31802 - 57之4.jpg', '31802 - 57之5.jpg', '31802 - 57之6.jpg', '31802 - 57之7.jpg', '31802 - 57之8.jpg', '31802 - 57之9.jpg', '31804', '31806', '31810', '31813', '31814', '31901', '31902', '32101', '32102', '32103', '32104', '32107', '32201', '32202', '32203', '32204', '32205', '32206', '32207', '32209', '32210', '32211', '32212', '32213', '32214', '32215', '32216', '32217', '32301', '32402', '32404', '32405', '32406', '32407', '32408', '32409', '32410', '32501', '32502', '32503', '32504', '32505', '32506', '32507', '32701', '32703', '32705', '32706', '32707', '34107', '34108', '34109', '34201', '34202', '34301', '34302', '34303', '34304', '34305', '34306', '35101', '35104', '35201', '35202', '35203', '35204', '35205', '35206', '35207', '35208', '35211', '35212', '35301', '35302']
var myList = [
    {
        title: "行政\n(181)\n1####.##",
        items: [
            { name: "總務\n(62)\n11###.##", objs: ["祀儀\n(2)\n111##.##", "吏務\n(14)\n112##.##", "吏紀\n(20)\n113##.##", "薪津\n(6)\n114##.##", "外事\n(10)\n115##.##", "移交\n(5)\n116##.##", "雜事\n(5)\n117##.##"] },
            { name: "民政\n(77)\n12###.##", objs: ["學務\n(2)\n121##.##", "鄉保\n(39)\n122##.##", "聯庄\n(3)\n123##.##", "保甲\n(6)\n124##.##", "厚俗\n(21)\n125##.##", "義倉\n(5)\n126##.##", "救恤\n(1)\n127##.##"] },
            { name: "財政\n(1)\n13###.##", objs: ["田賦\n(0)\n131##.##", "清賦\n(1)\n132##.##", "稅契\n(0)\n133##.##", "給照\n(0)\n134##.##", "釐金\n(0)\n135##.##", "錢幣\n(0)\n136##.##", "征收\n(0)\n137##.##", "解庫\n(0)\n138##.##", "雜事\n(0)\n139##.##"] },
            { name: "建設\n(2)\n14###.##", objs: ["民業\n(0)\n141##.##", "鹽務\n(0)\n142##.##", "樟腦\n(0)\n143##.##", "礦產\n(1)\n144##.##", "工程\n(1)\n145##.##"] },
            { name: "交通\n(0)\n15###.##", objs: ["驛站\n(0)\n151##.##", "船政\n(0)\n152##.##", "鐵路\n(0)\n153##.##", "義渡\n(0)\n154##.##"] },
            { name: "軍事\n(0)\n16###.##", objs: ["軍政\n(0)\n161##.##", "兵餉\n(0)\n162##.##", "城工\n(0)\n163##.##", "息庄\n(0)\n164##.##", "私火\n(0)\n165##.##"] },
            { name: "撫墾\n(39)\n17###.##", objs: ["社務\n(12)\n171##.##", "社租\n(11)\n172##.##", "隘務\n(13)\n173##.##", "屯務\n(3)\n174##.##"] }
        ]
    },
    {
        title: "民事\n(98)\n2####.##",
        items: [
            { name: "人事\n(5)\n21###.##", objs: ["失蹤\n(0)\n211##.##", "結婚\n(2)\n212##.##", "離婚\n(0)\n213##.##", "收養\n(2)\n214##.##", "監護\n(1)\n215##.##"] },
            { name: "田房\n(93)\n22###.##", objs: ["租借\n(6)\n221##.##", "抗租\n(11)\n222##.##", "霸收\n(3)\n223##.##", "霸佔\n(33)\n224##.##", "爭界\n(18)\n225##.##", "爭財\n(11)\n226##.##", "公業\n(8)\n227##.##", "用水\n(3)\n228##.##", "抄押\n(0)\n229##.##"] },
            { name: "錢債\n(0)\n23###.##", objs: ["買賣\n(0)\n231##.##", "典當\n(0)\n232##.##", "胎借\n(0)\n233##.##", "借貸\n(0)\n234##.##", "委寄\n(0)\n235##.##", "討物\n(0)\n236##.##", "抗吞\n(0)\n237##.##", "抗算\n(0)\n238##.##", "匿契\n(0)\n239##.##"] },
            { name: "商事\n(0)\n24###.##", objs: ["郊行\n(0)\n241##.##", "合股\n(0)\n242##.##", "倒閉\n(0)\n243##.##", "侵權\n(0)\n244##.##"] }
        ]
    },
    {
        title: "刑事\n(103)\n3####.##",
        items: [
            { name: "總務\n(36)\n31###.##", objs: ["法令\n(1)\n311##.##", "冊報\n(1)\n312##.##", "指揮\n(0)\n313##.##", "互助移解\n(12)\n314##.##", "通緝\n(5)\n315##.##", "驗屍\n(5)\n316##.##", "定讞\n(3)\n317##.##", "執行\n(7)\n318##.##", "其他\n(2)\n319##.##"] },
            { name: "人身自由\n(42)\n32###.##", objs: ["人命\n(5)\n321##.##", "毆傷\n(16)\n322##.##", "勒贖\n(1)\n323##.##", "誘拐\n(8)\n324##.##", "略賣\n(7)\n325##.##", "擄禁\n(0)\n326##.##", "擄搶\n(5)\n327##.##"] },
            { name: "財產侵奪\n(0)\n33###.##", objs: ["竊盜\n(0)\n331##.##", "搶奪\n(0)\n332##.##", "強盜\n(0)\n333##.##", "強盜殺傷\n(0)\n334##.##", "海盜\n(0)\n335##.##", "恐嚇\n(0)\n336##.##", "詐欺\n(0)\n337##.##", "盜賣\n(0)\n338##.##", "毀棄\n(0)\n339##.##"] },
            { name: "公共秩序\n(11)\n34###.##", objs: ["匪徒\n(3)\n341##.##", "侵害水源\n(2)\n342##.##", "騷擾\n(6)\n343##.##", "謠言\n(0)\n344##.##"] },
            { name: "風化\n(14)\n35###.##", objs: ["忤逆\n(2)\n351##.##", "毀墳\n(10)\n352##.##", "通姦\n(2)\n353##.##", "拐姦\n(0)\n354##.##", "賭博\n(0)\n355##.##"] }
        ]
    }
];

var contents = [
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "1",
        "年號": "咸豐",
        "年": "10",
        "月": "4",
        "地域": "",
        "關係人姓名": "",
        "案由": "長佑宮捐題",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "2",
        "年號": "光緒",
        "年": "5",
        "月": "閏3",
        "地域": "",
        "關係人姓名": "",
        "案由": "新任閱域並開儀",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "3",
        "年號": "光緒",
        "年": "5",
        "月": "7",
        "地域": "",
        "關係人姓名": "",
        "案由": "中元普度",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "4",
        "年號": "光緒",
        "年": "5",
        "月": "7",
        "地域": "",
        "關係人姓名": "",
        "案由": "城隍廟普度",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "5",
        "年號": "光緒",
        "年": "8",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "大眾爺捐建",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "6",
        "年號": "光緒",
        "年": "15",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "醮務分別核轉",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "1",
        "號件": "7",
        "年號": "光緒",
        "年": "17",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "文昌祠修建營兵滋鬧",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "1",
        "年號": "嘉慶",
        "年": "25",
        "月": "",
        "地域": "",
        "關係人姓名": "李鴻圖",
        "案由": "淡防廳右典吏充任",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "2",
        "年號": "同治",
        "年": "9",
        "月": "4",
        "地域": "",
        "關係人姓名": "",
        "案由": "辦事細則",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "3",
        "年號": "光緒",
        "年": "2",
        "月": "1",
        "地域": "",
        "關係人姓名": "李錄、許祥",
        "案由": "經辦案卷稟繳",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "4",
        "年號": "光緒",
        "年": "4",
        "月": "3",
        "地域": "",
        "關係人姓名": "",
        "案由": "匠首換給新戳",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "5",
        "年號": "光緒",
        "年": "5",
        "月": "9",
        "地域": "",
        "關係人姓名": "陳長興",
        "案由": "挑夫頭充任",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "6",
        "年號": "光緒",
        "年": "7",
        "月": "8",
        "地域": "",
        "關係人姓名": "姚景",
        "案由": "差役充任",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "7",
        "年號": "光緒",
        "年": "7",
        "月": "9",
        "地域": "",
        "關係人姓名": "蔡進發",
        "案由": "挑夫首選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "8",
        "年號": "光緒",
        "年": "8",
        "月": "2",
        "地域": "",
        "關係人姓名": "薛清",
        "案由": "差役選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "9",
        "年號": "光緒",
        "年": "8",
        "月": "5",
        "地域": "",
        "關係人姓名": "洪清、江雲",
        "案由": "差役選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "10",
        "年號": "光緒",
        "年": "9",
        "月": "6",
        "地域": "",
        "關係人姓名": "吳德",
        "案由": "銀匠首舉充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "11",
        "年號": "光緒",
        "年": "9",
        "月": "9",
        "地域": "",
        "關係人姓名": "倪源",
        "案由": "差役選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "12",
        "年號": "光緒",
        "年": "12",
        "月": "8",
        "地域": "",
        "關係人姓名": "蕭嘉",
        "案由": "差役選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "13",
        "年號": "光緒",
        "年": "12",
        "月": "10",
        "地域": "",
        "關係人姓名": "張濟川",
        "案由": "請假",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "14",
        "年號": "光緒",
        "年": "13",
        "月": "9",
        "地域": "",
        "關係人姓名": "蔡誠、施芳",
        "案由": "差役選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "15",
        "年號": "光緒",
        "年": "16",
        "月": "1",
        "地域": "",
        "關係人姓名": "許典",
        "案由": "接辦堂書",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "16",
        "年號": "光緒",
        "年": "17",
        "月": "3",
        "地域": "",
        "關係人姓名": "王秋菊、朱明",
        "案由": "轎差",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "2",
        "號件": "17",
        "年號": "光緒",
        "年": "20",
        "月": "3",
        "地域": "",
        "關係人姓名": "陳榮、鄭鏡清",
        "案由": "庄書選充",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "1",
        "年號": "乾隆",
        "年": "54",
        "月": "",
        "地域": "",
        "關係人姓名": "陳善、莊德等",
        "案由": "勒索",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "2",
        "年號": "咸豐",
        "年": "7",
        "月": "",
        "地域": "",
        "關係人姓名": "蔡雲",
        "案由": "華差謠言",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "3",
        "年號": "同治",
        "年": "6",
        "月": "",
        "地域": "",
        "關係人姓名": "吳順記（稟）、張忠",
        "案由": "撞索",
        "附註": "封皮"
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "4",
        "年號": "同治",
        "年": "13",
        "月": "",
        "地域": "",
        "關係人姓名": "溫天送",
        "案由": "吞沒勇糧",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "5",
        "年號": "光緒",
        "年": "2",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "開參記遇",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "6",
        "年號": "光緒",
        "年": "5",
        "月": "5",
        "地域": "",
        "關係人姓名": "呂祥、李登",
        "案由": "抗交卷宗",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "7",
        "年號": "光緒",
        "年": "5",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "侵賬各員罪名列冊",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "8",
        "年號": "光緒",
        "年": "5",
        "月": "",
        "地域": "",
        "關係人姓名": "龔養元暨家屬",
        "案由": "追討侵欠公款",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "9",
        "年號": "光緒",
        "年": "7",
        "月": "8",
        "地域": "",
        "關係人姓名": "",
        "案由": "禁止索取規外訟費",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "10",
        "年號": "光緒",
        "年": "7",
        "月": "9",
        "地域": "",
        "關係人姓名": "",
        "案由": "禁止索取燈油於差役",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "11",
        "年號": "光緒",
        "年": "8",
        "月": "",
        "地域": "",
        "關係人姓名": "陳頂、鄭春風、楊九典",
        "案由": "轎差誤事",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "12",
        "年號": "光緒",
        "年": "9",
        "月": "1",
        "地域": "",
        "關係人姓名": "楊祥、徐祥",
        "案由": "納賄查辦",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "13",
        "年號": "光緒",
        "年": "9",
        "月": "6",
        "地域": "",
        "關係人姓名": "",
        "案由": "罰俸銀數造送",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "14",
        "年號": "光緒",
        "年": "10",
        "月": "3",
        "地域": "",
        "關係人姓名": "王佐等",
        "案由": "差役侵占比追",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "15",
        "年號": "光緒",
        "年": "10",
        "月": "7",
        "地域": "",
        "關係人姓名": "林貴",
        "案由": "欠繳公項押追",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "16",
        "年號": "光緒",
        "年": "11",
        "月": "",
        "地域": "",
        "關係人姓名": "",
        "案由": "催參官罰俸冊報",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "17",
        "年號": "光緒",
        "年": "12",
        "月": "7",
        "地域": "",
        "關係人姓名": "",
        "案由": "呈報參罰",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "18",
        "年號": "光緒",
        "年": "12",
        "月": "8",
        "地域": "",
        "關係人姓名": "",
        "案由": "參官罰俸",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "19",
        "年號": "光緒",
        "年": "13",
        "月": "3",
        "地域": "",
        "關係人姓名": "丈書陳欽等",
        "案由": "短量弓索",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "20",
        "年號": "光緒",
        "年": "13",
        "月": "閏4",
        "地域": "",
        "關係人姓名": "孔昭慈",
        "案由": "追賠款項請旨豁免",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "21",
        "年號": "光緒",
        "年": "13",
        "月": "閏4",
        "地域": "",
        "關係人姓名": "鄭維匡等（稟）、丈書差",
        "案由": "丈差撫弊",
        "附註": ""
    },
    {
        "門": "一",
        "類": "一",
        "款": "3",
        "號件": "22",
        "年號": "光緒",
        "年": "13",
        "月": "8",
        "地域": "",
        "關係人姓名": "呂木、楊坤",
        "案由": "丈差勒索",
        "附註": ""
    }
]

//切換目錄類型
document.getElementById("contentsBtn").addEventListener("click", function () {
    document.getElementById("excelDataTable").innerHTML = "";
    buildContents("#excelDataTable");
})
document.getElementById("tableBtn").addEventListener("click", function () {
    document.getElementById("excelDataTable").innerHTML = "";
    buildHtmlTable("#excelDataTable");
})

//用id換不同的內容
const params = new URLSearchParams(window.location.search);
const id = params.get("id");
if (id) {
    const container = document.getElementById("content");
    container.innerHTML = "";
    for (item of fileName) {
        if (item.lastIndexOf(id, 0) == 0) {
            container.innerHTML += "<p class = \"downloadLink\"><a href=\"../pdf/" + item + ".pdf\" download= \"" + item + ".pdf\"" + ">" + item + "</a></p>";
        }
    }

} else {
    buildHtmlTable("#excelDataTable");  // show table
    // buildContents("#excelDataTable")
}

function buildCaseTitle(value) {
    var caseTitle = document.createElement("p");
    caseTitle.setAttribute("class", "caseTitle");
    caseTitle.textContent = value.slice(0, value.indexOf("\n"))
    return caseTitle
}

function buildCaseInfo(value) {
    var caseInfo = document.createElement("p");
    caseInfo.setAttribute("class", "caseInfo");
    caseInfo.textContent = value.slice(value.indexOf("\n") + 1)
    return caseInfo
}
//建立總目錄
function buildHtmlTable(selector) {
    var table = document.querySelector(selector);

    for (var i = 0; i < myList.length; i++) {
        var group = myList[i];
        var rowspan = group.items.length;

        for (var j = 0; j < group.items.length; j++) {
            var row = document.createElement("tr");

            if (j === 0) {
                var th = document.createElement("th");
                var value = group.title
                th.setAttribute("rowspan", rowspan);
                th.appendChild(buildCaseTitle(value));
                th.appendChild(buildCaseInfo(value));

                row.appendChild(th);
            }

            // sub title
            var subTh = document.createElement("th");
            var value = group.items[j].name;
            subTh.appendChild(buildCaseTitle(value));
            subTh.appendChild(buildCaseInfo(value));

            row.appendChild(subTh);

            // objects
            var objs = group.items[j].objs || [];

            for (let i = 0; i < 9; i++) {
                var value = objs[i] || "";
                var fileNum = value ? value.slice(value.indexOf("(") + 1, value.indexOf(")")) : "";
                var idNumber = value ? value.slice(-8, -5) : "";
                var td = document.createElement("td");

                if (value) {
                    let link;
                    // 如果沒有案件可以下載就不要做連結
                    if (fileNum == "0") {
                        link = document.createElement("p");
                    } else {
                        link = document.createElement("a");
                        link.setAttribute("href", "../index.html?id=" + idNumber);
                    }

                    link.appendChild(buildCaseTitle(value));
                    link.appendChild(buildCaseInfo(value));
                    link.setAttribute("id", idNumber);

                    td.appendChild(link);
                }
                row.appendChild(td);
            };
            table.appendChild(row);
        }
    }
}
//建立簡明目錄
function buildContents(selector) {
    var table = document.querySelector(selector);
    var columns = addAllColumnHeaders(contents, selector);

    for (var i = 0; i < contents.length; i++) {
        var row = document.createElement("tr");;
        for (var colIndex = 0; colIndex < columns.length; colIndex++) {
            var td = document.createElement("td");
            var cellValue = contents[i][columns[colIndex]];

            if (cellValue == null) cellValue = "";
            td.textContent = cellValue;
            row.appendChild(td);
        }
        table.appendChild(row);
    }
}
function addAllColumnHeaders(contents, selector) {
    var table = document.querySelector(selector);
    var columnSet = [];
    var headerTr = document.createElement("tr");;

    for (var i = 0; i < contents.length; i++) {
        var rowHash = contents[i];
        for (var key in rowHash) {
            if (!columnSet.includes(key)) {
                var th = document.createElement("th");
                columnSet.push(key);
                th.textContent = key;
                headerTr.appendChild(th);
            }
        }
    }
    table.appendChild(headerTr);

    return columnSet;
}

const titleSelect = document.getElementById("doorSelect");
const nameSelect = document.getElementById("cateSelect");
const objSelect = document.getElementById("secSelect");

// Populate title dropdown
myList.forEach((d, index) => {
    const option = document.createElement("option");
    option.value = index;
    option.textContent = d.title.slice(0, d.title.indexOf("\n"));
    titleSelect.appendChild(option);
});

titleSelect.addEventListener("change", () => {
    const selectedIndex = titleSelect.value;
    nameSelect.innerHTML = "";
    const items = myList[selectedIndex].items;

    items.forEach((item, index) => {
        const option = document.createElement("option");
        option.value = index;
        option.textContent = item.name.slice(0, item.name.indexOf("\n"));
        nameSelect.appendChild(option);
    });

    //Auto-select first item
    nameSelect.value = "0";
    nameSelect.dispatchEvent(new Event("change"));
});

// When name changes → populate objects
nameSelect.addEventListener("change", () => {
    const titleIndex = titleSelect.value;
    const nameIndex = nameSelect.value;

    objSelect.innerHTML = "";

    const selectedItem = myList[titleIndex].items[nameIndex];

    selectedItem.objs.forEach(obj => {
        const option = document.createElement("option");
        option.value = obj;
        option.textContent = obj.slice(0, obj.indexOf("\n"));;
        objSelect.appendChild(option);
    });

    //Auto-select first item
    objSelect.value = selectedItem.objs[0];
});

//Auto select first title
if (myList.length > 0) {
    titleSelect.value = "0";
    titleSelect.dispatchEvent(new Event("change"));
}